# ElectricalPotential Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ElectricalPotential Property
SpecTypeId Class See Also
---
Electrical Potential, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ElectricalPotential { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalPotential As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElectricalPotential {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace